<style lang="scss">
  #login{
    width: 100%;
    height: 100vh;
    background: url('~@/assets/images/loginBg.svg') no-repeat;
    background-color: rgb(246,246,246);
    background-size: contain;
    position: relative;
    display: flex;
    align-items: center;
    justify-content: center;
    $width: 140px;
    .login-box{
      display: flex;
      align-items: center;
      justify-content: space-between;
      width: calc(100% - 140px);
      height: calc(100vh - 140px);
      min-height: 400px;
      max-width: 1300px;
      margin: 0 auto;
      border-radius: 10px;
      background: white;
      box-shadow: 0 1px 20px rgba(0,0,0,.15);
      border: 1px solid rgba(0,0,0,.05);
      &-left{
        width: 70%;
        height: 100%;
        position: relative;
        .logo{
          width: 170px;
          position: absolute;
          top: 20px;
          left: 20px;
          img{
            width: 100%;
          }
        }
        .left-info{
          width: 100%;
          height: 100%;
          background: url('~@/assets/images/receptionist-job-description.jpg') no-repeat;
          background-size: contain;
          background-position: 50% 50%;
        }
      }
      &-right{
        width: 30%;
        .subtitle{
          margin-bottom: 0px;
          color: rgba(0,0,0,.5);
          font-size: 16px;
        }
        .form{
          width: 300px;
          position: relative;
          .error{
            margin: 15px 0;
            color: $red;
            font-size: 14px;
            min-height: 19px;
          }
          .input{
            margin-bottom: 15px;
          }
          button{
            width: 180px;
            margin-top: 20px;
          }
          .tips{
            font-size: 14px;
            display: flex;
            align-items: center;
            justify-content: space-between;
            color: $grey;
          }
          .other{
            margin-top: 60px;
            font-size: 14px;
            color: $grey;
            &-box{
              display: flex;
              align-items: center;
              justify-content: flex-start;
              margin-top: 20px;
              &-item{
                svg{
                  width: 35px;
                  height: 35px;
                  margin-right: 35px;
                  cursor: pointer;
                }
                .wx{
                  &:hover{
                    path{
                      fill: rgb(30,208,55)
                    }
                  }
                }
                .dd{
                  &:hover{
                    path{
                      fill: rgb(51,153,255)
                    }
                  }
                }
                .wb{
                  &:hover{
                    path{
                      fill: rgb(237,50,41)
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  }
</style>

<template>
  <div id="login">
    <div class="login-box">
      <div class="login-box-left">
        <div class="logo">
          <img src="@/assets/images/logo.png" alt="logo">
        </div>
        <div class="left-info"></div>
      </div>
      <div class="login-box-right">
        <h1>欢迎登录</h1>
        <p class="subtitle">{{ title }}</p>
        <form class="form" @keyup.enter="login">
          <div class="error">
            <span v-if="errmsg"><i class="el-icon-warning"></i> 错误：{{ errmsg }}</span>
          </div>
          <el-input class="input" v-model="username" placeholder="请输入您的账户" autofocus></el-input>
          <el-input class="input" placeholder="请输入您的密码" v-model="password" show-password></el-input>
          <div class="tips">
            <p>没有帐号？<a @click="register">立即注册</a></p>
            <a @click="forgot">忘了密码</a>
          </div>
          <el-button type="primary" @click="login" :loading="postting">登录</el-button>
          <div class="other">
            <p>使用第三方平台登录</p>
            <div class="other-box">
              <div class="other-box-item">
                <svg
                  @click="loginByOther('wx')"
                  t="1590548597309"
                  class="icon wx"
                  viewBox="0 0 1229 1024"
                  version="1.1"
                  xmlns="http://www.w3.org/2000/svg"
                  p-id="16935"
                  width="35"
                  height="35"><path d="M978.674253 587.404744C957.153505 587.404744 935.478764 565.845499 935.478764 543.901266 935.478764 522.226524 957.153505 500.397788 978.674253 500.397788 1011.282611 500.397788 1033.111347 522.226524 1033.111347 543.901266 1033.111347 565.845499 1011.282611 587.404744 978.674253 587.404744M739.443625 587.404744C717.80738 587.404744 695.940147 565.845499 695.940147 543.901266 695.940147 522.226524 717.80738 500.397788 739.443625 500.397788 772.359972 500.397788 793.880719 522.226524 793.880719 543.901266 793.880719 565.845499 772.359972 587.404744 739.443625 587.404744M1228.8 641.841838C1228.8 467.943424 1054.824586 326.191386 859.366927 326.191386 652.436669 326.191386 489.471871 467.943424 489.471871 641.841838 489.471871 816.009743 652.436669 957.453793 859.366927 957.453793 902.677914 957.453793 946.373883 946.520177 989.877361 935.625057L1109.184686 1000.957271 1076.460831 892.237076C1163.775775 826.750868 1228.8 739.897907 1228.8 641.841838M831.840389 302.830403C845.969398 302.830403 859.90591 303.869866 873.726925 305.409812 836.113741 130.163945 648.779295 0 434.919281 0 195.842647 0 0 162.926299 0 369.856558 0 489.317878 65.139721 587.412444 174.052409 663.485783L130.548932 794.304205 282.580111 718.076872C336.978708 728.856494 380.63618 739.905608 434.919281 739.905608 448.547804 739.905608 462.09933 739.251133 475.535359 738.173169 467.027157 709.106688 462.09933 678.654249 462.09933 647.046856 462.09933 457.056005 625.256622 302.830403 831.840389 302.830403M597.999575 184.909029C630.761928 184.909029 652.436669 206.468275 652.436669 239.19213 652.436669 271.800489 630.761928 293.629225 597.999575 293.629225 565.429714 293.629225 532.705859 271.800489 532.705859 239.19213 532.705859 206.468275 565.429714 184.909029 597.999575 184.909029M293.629225 293.629225C261.020866 293.629225 228.143016 271.800489 228.143016 239.19213 228.143016 206.468275 261.020866 184.909029 293.629225 184.909029 326.237584 184.909029 347.912325 206.468275 347.912325 239.19213 347.912325 271.800489 326.237584 293.629225 293.629225 293.629225" p-id="16936" fill="#999999"></path></svg>
                <svg
                  @click="loginByOther('dd')"
                  t="1590549271786"
                  class="icon dd"
                  viewBox="0 0 1024 1024"
                  version="1.1"
                  xmlns="http://www.w3.org/2000/svg"
                  p-id="19157"
                  width="35"
                  height="35"><path d="M899.300557 382.7712a194.43712 194.43712 0 0 1-11.8784 31.70304h0.16384l-0.73728 1.2288c-34.52928 76.67712-124.76416 227.00032-124.76416 227.00032s-0.12288-0.36864-0.49152-0.90112l-26.37824 47.5136h127.13984L619.584717 1024l55.0912-227.65568H574.610637l34.73408-150.528c-28.09856 7.04512-61.31712 16.71168-100.67968 29.81888 0 0-53.248 32.3584-153.3952-62.17728 0 0-67.54304-61.6448-28.34432-77.08672 16.62976-6.5536 80.81408-14.86848 131.31776-21.95456 68.28032-9.50272 110.30528-14.62272 110.30528-14.62272s-210.5344 3.2768-260.42368-4.87424c-49.93024-8.11008-113.2544-94.49472-126.73024-170.3936 0 0-20.8896-41.65632 44.89216-21.95456 65.7408 19.74272 337.79712 76.84096 337.79712 76.84096S210.230477 266.93632 186.678477 239.49312C163.167437 212.04992 117.415117 89.74336 123.354317 14.58176c0 0 2.58048-18.75968 21.13536-13.7216 0 0 261.61152 123.94496 440.48384 191.73376 178.87232 67.82976 334.39744 102.4 314.32704 190.17728z" fill="#999999" p-id="19158"></path></svg>
                <svg
                  @click="loginByOther('wb')"
                  t="1590549216130"
                  class="icon wb"
                  viewBox="0 0 1031 1024"
                  version="1.1"
                  xmlns="http://www.w3.org/2000/svg"
                  p-id="18327"
                  width="35"
                  height="35"><path d="M765.92 501.92l-16-6.208c-17.984-10.336-4-26.848-4-26.848s8-14.464 12-37.184c5.984-24.8 4-57.824-20-84.672a68.608 68.608 0 0 0-45.984-24.768c-13.984-2.08-28-2.08-40-2.08-56 6.208-111.968 33.056-111.968 33.056-53.984 20.64-40-8.256-32-51.616 0-53.696-16-144.576-159.968-90.88s-267.936 241.632-267.936 241.632C-3.904 578.336 8.096 673.344 8.096 673.344c20 212.704 227.936 270.528 389.888 284.992 167.968 14.464 395.904-64.032 463.872-225.088 69.984-159.008-55.968-223.04-95.968-231.296zM410.016 898.432c-169.952 8.256-305.92-82.624-305.92-206.528 0-121.856 135.968-218.912 305.92-227.168 167.968-10.304 301.92 66.08 301.92 187.936s-133.952 237.504-301.92 245.76zM376.032 545.28c-169.952 20.672-149.952 194.144-149.952 194.144s-1.984 53.696 45.984 80.544c97.984 59.904 199.936 24.8 251.936-47.488 49.984-74.336 20-249.888-147.968-227.168z m-41.984 241.632c-32 4.128-57.984-16.512-57.984-45.44s24-57.824 53.984-61.952c36-4.128 60 18.592 60 47.488s-25.984 55.744-56 59.904z m97.952-92.96c-9.984 8.256-21.984 8.256-28-2.048s-4-26.848 5.984-35.104c13.984-10.336 25.984-8.256 32 2.08s1.984 26.848-10.016 35.104z m415.904-268.448a28.352 28.352 0 0 0 28-24.8v-4.128c20-202.4-151.968-167.264-151.968-167.264-16 0-28 12.384-28 28.896s12 30.976 28 30.976c123.968-30.976 95.968 107.392 95.968 107.392 0 16.512 12 28.896 28 28.896z m-20-353.152c-59.968-16.512-119.968-4.128-137.952 0-2.016 0-2.016 2.048-4 2.048-17.984 6.208-29.984 22.72-29.984 43.36 0 24.768 17.984 43.36 40 43.36 0 0 21.984-2.048 36-8.256 12-4.128 77.984-6.208 137.984 37.184 5.984 4.128 12 8.256 17.984 14.464 16 14.464 31.968 33.056 43.968 55.744 33.984 82.624 14.016 136.32 12 148.704 0 0-8 20.64-8 41.312 0 24.8 17.984 39.232 40 39.232 17.984 0 33.984-2.048 37.984-37.184h2.016c64-241.632-81.984-353.152-187.968-380z" fill="#999999" p-id="18328"></path></svg>
              </div>
            </div>
          </div>
        </form>
      </div>
    </div>
  </div>
</template>

<script>
import { title, token } from '@config'
export default {
  data () {
    return {
      title,
      username: null,
      password: null,
      errmsg: null,
      postting: false
    }
  },
  watch: {
    username () {
      this.errmsg = null
    },
    password () {
      this.errmsg = null
    }
  },
  methods: {
    register () {
      this.errmsg = '暂不支持注册功能'
    },
    forgot () {
      this.errmsg = '暂不支持重置密码功能，请联系管理员'
    },
    loginByOther (method) {
      this.errmsg = `暂不支持第三方登录`
    },
    login () {
      if (!this.username) {
        this.errmsg = '请输入您的账户'
      } else if (!this.password) {
        this.errmsg = '请输入您的密码'
      } else {
        this.postting = true
        // 这里写登录逻辑
        setTimeout(() => {
          const { query } = this.$route
          this.$ls.set(`${token}`, `${this.username}${this.password}`)
          this.$router.push(query && query.redirect ? query.redirect : '/home')
        }, 2000)
      }
    }
  }
}
</script>
